regtests/0383_simple_content_attribute/test.out

ex:
<n1:ExampleType unit="cm">1</n1:ExampleType>
[CLIENT/call] Payload : <?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body
 xmlns:awsns="http://soapaws/"
 xmlns:n1="http://simple.doc.net/sd">
<n1:ExampleType unit="cm">1</n1:ExampleType>
</soapenv:Body>
</soapenv:Envelope>

[SERVER/call_CB] Payload recv : <?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body
 xmlns:awsns="http://soapaws/"
 xmlns:n1="http://simple.doc.net/sd">
<n1:ExampleType unit="cm">1</n1:ExampleType>
</soapenv:Body>
</soapenv:Envelope>

[SERVER/call_CB] SOAPAction : http://me.here.net/call
[SERVER/call_CB] Payload : <?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body
>
<ExampleType unit="cm">1</ExampleType>
</soapenv:Body>
</soapenv:Envelope>

ExampleType:
(ATTRIBUTE_VALUE =>  1,
 UNIT => "cm")
[SERVER/call_CB] Response : <?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body
>
</soapenv:Body>
</soapenv:Envelope>

[CLIENT/call] Response : <?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body
>
</soapenv:Body>
</soapenv:Envelope>
